[{"title":"欢迎来到我的鱼塘","date":"2019-03-17T18:19:30.566Z","path":"2019/03/18/First/","text":"前几天看到知乎的一个问题：为什么要自己搭建博客？ 很多人给出的答案都是 “为了更自由，为了构建属于自己的世界” 所以虽然我知道这对我来说可能很难，但我还是要试试。 说实话我自己的水平我也清楚，在这方面我是条真的咸鱼。 除了暑假看了点Python教程也算入了个门。然而我知道入门并没有什么用（摊手） 我知道自己想要的是什么。我未来可能不会成为码农。 可我喜欢尝试，喜欢去做那些看上去很有趣的事情 因为是零基础所以我在建这个博客的时候也遇到了无数别人没遇到的问题。 所幸最后都靠百度和必应解决了。 我们都还年轻，我们的身上还有无限的可能性 所以人生苦短，我学Python（滑稽） 那么， 很高兴你们愿意花时间来认识我， 欢迎你们来到我的鱼塘。 附上某位大佬手把手教你搭建blog的教程一篇https://zhangslob.github.io/","tags":[{"name":"随笔","slug":"随笔","permalink":"http://yoursite.com/tags/随笔/"}]},{"title":"日常脑洞","date":"2019-03-17T18:19:30.524Z","path":"2019/03/18/日常临摹/","text":"日常脑洞合集，不定期更新 4.04.2017 &nbsp; 《祭奠爱情》 3.25.2017 &nbsp; 《鬼》https://xianyukiring.github.io/2017/03/27/%E9%AC%BC/ 2.12.2017 &nbsp; 《KUN》 2.01.2017 &nbsp; 《线体球》","tags":[{"name":"设计","slug":"设计","permalink":"http://yoursite.com/tags/设计/"},{"name":"临摹","slug":"临摹","permalink":"http://yoursite.com/tags/临摹/"}]},{"title":"2017.7.9","date":"2017-07-09T07:49:47.000Z","path":"2017/07/09/2017-7-9/","text":"2017.7.5，我从杭州出发，前往河南南阳 2017.7.9，我离开了河南，前往重庆 其实这次来河南并不是嘴上说的“我想去领略祖国的山河壮丽” 毕竟南阳也没什么壮丽山河 我来，是为了见一个人 一个本来可能是对的人 可惜最后还是没有跨过那一步 基友说我像个傻子，跨越700多公里就为了来见你 我真的就是个傻子。被骗的团团转到最后才发现，原来你想要的不是我 是不是很惊喜，本来想放弃这个博客。然后今天GitHub给我发了封邮件，我又想起来 我还有个博客 虽然看官也没几个，但是我想既然我创建了他，就不能让他烂在角落里 今后依然会不定期写随笔发牢骚 爱看不看","tags":[{"name":"随笔","slug":"随笔","permalink":"http://yoursite.com/tags/随笔/"}]},{"title":"The Last","date":"2017-04-07T16:00:00.000Z","path":"2017/04/08/the-last/","text":"这可能是这鱼塘的最后一篇随笔 这几天人很难受，肠胃炎咽喉炎感冒发烧一起来 这是我从去年这个时候到现在最严重的一次 心悸，胸闷气短，全身一点力气也没有 朋友说是心病，是因为刚刚失恋，可我也没有那么难过啊 我前几天上摄影课的时候发烧烧的糊里糊涂睡着啦 梦到你急匆匆的跑过来带我去医院 我说我走不动，你便一把抱起我就跑下楼打车去医院 到了医院帮我挂号缴费取药拉着我去发热门诊 在等叫号的时候我就抱着你靠在你胸前 就连那感觉也和以前一样 可猛然惊醒，老师依旧再讲理论，同桌依然在玩手机 你也一样不再我身边 哈哈哈 哈 。 最近发现自己变了，变得越来越不像自己 和我打过游戏的都人知道，我从来不会把游戏的输赢看的很重，所以每次打游戏我都会打的很开心 所以我以前也对那些因为队友不会玩或者输了游戏而生气的人表示很费解。 但这次不一样。。因为队友不会玩我开始心态崩了，甚至还说“不会玩玩什么输出” 对，我发现自己渐渐变成了曾经讨厌过的样子 我明白，写的这些东西帮不到大家可能也没人会看。所以我打算重新配一遍这个bolg 我会把它改造成技术分享向的博客，自己可能也会不定期出一些实用教程 动效设计/交互设计/包装/特效合成/编程/爬虫 可能五月份，也可能更晚 到时候域名不会变，我可能会在GitHub上再开一个项目再弄一个博客，把所有的随笔迁过去 祝我能变成自己想要成为的那个样子，祝自己能一直坚持做自己想做的事","tags":[{"name":"随笔","slug":"随笔","permalink":"http://yoursite.com/tags/随笔/"}]},{"title":"分手快乐","date":"2017-04-03T16:00:00.000Z","path":"2017/04/04/Happy break up/","text":"告诉大家一个好消息，我回归单身了。 四月二日，我结束了一段长达四个月的感情。 那天早上你提出分手的时候我还以为只是迟到的愚人节玩笑而已。 嘻嘻 还记得最开始你找到我的时候，我们都觉得对方是那个值得自己托付终身的人。 但最后我们还是被打败了 始于颜值，陷于才华，败于距离 所以我一直反对异地恋的原因是我知道即使只有两个小时的车程，距离也会成为我们之间最大的障碍。 有人说只要遇到的是对的人，距离和时间都不是问题 他放屁 所以我们最后还是分开了 记得我曾经跟你说过，我喜欢你，我喜欢和你一起生活，我希望能和你一起睡觉一起起床、一起上课一起下课、一起吃饭一起散步、一起泡图书馆一起自习。希望能和你在节假日一起看电影一起浪一起旅游一起吃烤肉一起做一切我们想做的事。但无奈最后我们还是走散了。 当过了蜜月期的时候我才发现，异地真的要面对太多的挑战。 我好想和你一起生活啊，甚至我下决心专升本除了自己不甘心以外很大一部分原因也是你。我只是想考到离你近点的地方，我只是想陪在你身边而已。 可到后来我发现，两年的等待还是太漫长，在我努力的时候你已经想开始新的生活了。 其实我经常会去你在用的社交软件上偷偷看你。知乎，微博，豆瓣，zank，甚至是唱吧。所以我也知道你不肯告诉我的分手的原因是你找到了新的男朋友。浙传，离你不远 你也不会知道你新男朋友是我高中同学的大学室友。 你也不会知道他跟我是同一个守望车队的，我们不仅认识还是朋友。 去他妈的近水楼台先得月 我了解他，他和我很像，而且为人不错，所以你们真的在一起了我也没理由没办法阻止。 但我还是很难过啊，最喜欢的人和好朋友在一起了，我又变成了一个人。 我还是太年轻，只希望今后能为自己而活。 我对你任有爱意，我对自己无能为力 林先生，我还是很喜欢你，但我已经不能再爱你了","tags":[{"name":"随笔","slug":"随笔","permalink":"http://yoursite.com/tags/随笔/"}]},{"title":"《鬼》","date":"2017-03-26T16:00:00.000Z","path":"2017/03/27/鬼/","text":"经常说，灵感来源于巧合。所以很多时候在填老坑的时候，因为一些巧合，新的想法就来了。 张指导曾经告诉过我，要记得经常记录自己的想法。即使这些想法是不成熟的、不可行的。 但这些想法很有可能会在未来给你意想不到的帮助。 做这张图的初衷其实是自己看腻了笔记本的壁纸又不想用别人的，所以就想着用C4D做张壁纸自己玩。 最开始想做的是一个上了金属材质的线体文字(参考我的临摹《KUN》) 然后。。很丢脸的是因为我做那个用的是python脚本，上的是毛发材质。而目前来说我并搞不定把毛发上金属材质 然而如果线没有体积感没有高光整个画面就会缺乏视觉冲击力。 对，我走进了死胡同 这里要感谢张指导前几天给我安利了一个组合叫“草东没有派对” 当时耳机里正好放到《大风吹》 哭啊 喊啊 叫你妈妈带你去买玩具啊 &nbsp; &nbsp; &nbsp; 快 快拿到学校炫耀吧 孩子 交点朋友吧哎呀呀 你看你手上拿的是什么啊 &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 那东西我们早就不屑啦 哈哈哈 仿佛让我回到了小时候，那时候看起来很正常的事，现在想来当时自己居然如此孤单。 大风吹著谁 谁就倒霉 每个人都想当鬼 都一样的下贱 每个人都想当鬼，都一样下贱。 以前的我也喜欢呼朋引伴，喜欢吵吵闹闹，时常自责自己没有满足他人的期盼。一旦落单就会如坐针毡，任何活动被撇下都会怀疑人生。别人笑了我也配合笑，别人哭了我也配合哭。最后终于活成身边人有意无意希望我活成的那个样子 然后心情莫名的烦躁，悲伤，难过。 最后就有了这张图 我是带着大量的负面情绪做完这图的。想表达的可能只是当时的情绪而已。 人都有两面性，白天的伪善与理性，夜晚的感性与真实 这些线就像人与人之间的关系，我相信人与人之间存在真正的友谊，但我始终觉得，大部分的所谓的友谊都只是为了利益。 我其实是个内心很孤僻的人，虽然我很好相处，但其实在内心我并不信任除自己以外的任何人 其实我也知道，你们几个从小陪我到现在的朋友是真心待我，我也是。我也想有更多真正的朋友 但很气啊，不知道从什么时候起，我开始难以相信任何准备靠近我的人了 我们都是鬼，都一样的下贱","tags":[{"name":"随笔","slug":"随笔","permalink":"http://yoursite.com/tags/随笔/"},{"name":"设计","slug":"设计","permalink":"http://yoursite.com/tags/设计/"}]}]